#Дано положительное действительное число. Выведите его дробную часть.
#На вход программе подается положительное действительное число.
#Программа должна вывести дробную часть числа в соответствии с условием задачи.

a = float(input())
print(a % 1)